[
{"data": ",  , or   is   used for   from  .  Web scraping software may directly access the   using the   or a web browser. While web scraping can be done manually by a software user, the term typically refers to automated processes implemented using a   or  . It is a form of copying in which specific data is gathered and copied from the web, typically into a central local   or spreadsheet, for later   or  .\n Scraping a web page involves fetching it and extracting from it. Fetching is the downloading of a page (which a browser does when a user views a page). Therefore, web crawling is a main component of web scraping, to fetch pages for later processing. Once fetched, extraction can take place. The content of a page may be  , searched and reformatted, and its data copied into a spreadsheet or loaded into a database. Web scrapers typically take something out of a page, to make use of it for another purpose somewhere else. An example would be finding and copying names and telephone numbers, companies and their URLs, or e-mail addresses to a list (contact scraping).\n As well as  , web scraping is used as a component of applications used for  ,   and  , online price change monitoring and  , product review scraping (to watch the competition), gathering real estate listings, weather data monitoring,  , research, tracking online presence and reputation,  , and  .\n  are built using text-based mark-up languages (  and  ), and frequently contain a wealth of useful data in text form. However, most web pages are designed for human   and not for ease of automated use. As a result, specialized tools and software have been developed to facilitate the scraping of web pages. Web scraping applications include  , price comparison, content monitoring, and more.  Businesses rely on web scraping services to efficiently gather and utilize this data.\n Newer forms of web scraping involve monitoring data feeds from web servers.  For example,   is commonly used as a transport mechanism between the client and the web server.\n There are methods that some websites use to prevent web scraping, such as detecting and disallowing bots from crawling (viewing) their pages. In response, there are web scraping systems that rely on using techniques in   parsing,   and   to simulate human browsing to enable gathering web page content for offline parsing\n Web scraping is the process of automatically mining data or collecting information from the World Wide Web. It is a field with active developments sharing a common goal with the   vision, an ambitious initiative that still requires breakthroughs in text processing, semantic understanding, artificial intelligence and  .\n The simplest form of web scraping is manually copying and pasting data from a web page into a text file or spreadsheet. Sometimes even the best web-scraping technology cannot replace a human's manual examination and copy-and-paste, and sometimes this may be the only workable solution when the websites for scraping explicitly set up barriers to prevent machine automation.\n A simple yet powerful approach to extract information from web pages can be based on the UNIX   command or  -matching facilities of programming languages (for instance   or  ).\n  and   can be retrieved by posting HTTP requests to the remote web server using  .\n Many websites have large collections of pages generated dynamically from an underlying structured source like a database. Data of the same category are typically encoded into similar pages by a common script or template. In data mining, a program that detects such templates in a particular information source, extracts its content, and translates it into a relational form, is called a  . Wrapper generation algorithms assume that input pages of a wrapper induction system conform to a common template and that they can be easily identified in terms of a URL common scheme.  Moreover, some   query languages, such as   and the HTQL, can be used to parse HTML pages and to retrieve and transform page content.\n By embedding a full-fledged web browser, such as the   or the   browser control, programs can retrieve the dynamic content generated by client-side scripts. These browser controls also parse web pages into a DOM tree, based on which programs can retrieve parts of the pages. Languages such as   can be used to parse the resulting DOM tree.\n There are several companies that have developed vertical specific harvesting platforms. These platforms create and monitor a multitude of \"bots\" for specific verticals with no \"man in the loop\" (no direct human involvement), and no work related to a specific target site. The preparation involves establishing the knowledge base for the entire vertical and then the platform creates the bots automatically. The platform's robustness is measured by the quality of the information it retrieves (usually number of fields) and its scalability (how quick it can scale up to hundreds or thousands of sites). This scalability is mostly used to target the   of sites that common aggregators find complicated or too labor-intensive to harvest content from.\n The pages being scraped may embrace   or semantic markups and annotations, which can be used to locate specific data snippets. If the annotations are embedded in the pages, as   does, this technique can be viewed as a special case of DOM parsing. In another case, the annotations, organized into a semantic layer,  are stored and managed separately from the web pages, so the scrapers can retrieve data schema and instructions from this layer before scraping the pages.\n There are efforts using   and   that attempt to identify and extract information from web pages by interpreting pages visually as a human being might. \n Uses advanced AI to interpret and process web page content contextually, extracting relevant information, transforming data, and customizing outputs based on the content's structure and meaning. This method enables more intelligent and flexible data extraction, accommodating complex and dynamic web content.\n The world of web scraping offers a variety of software tools designed to simplify and customize the process of data extraction from websites. These tools vary in their approach and capabilities, making web scraping accessible to both novice users and advanced programmers.\n Some advanced web scraping software can automatically recognize the data structure of a web page, eliminating the need for manual coding. Others provide a recording interface that allows users to record their interactions with a website, thus creating a scraping script without writing a single line of code. Many tools also include scripting functions for more customized extraction and transformation of content, along with database interfaces to store the scraped data locally.\n Web scraping tools are versatile in their functionality. Some can directly extract data from APIs, while others are capable of handling websites with AJAX-based dynamic content loading or login requirements. Point-and-click software, for instance, empowers users without advanced coding skills to benefit from web scraping. This democratizes access to data, making it easier for a broader audience to leverage the power of web scraping.\n \n  A Python library that provides simple methods for extracting data from HTML and XML files.\n  An open-source and collaborative web crawling framework for Python that allows you to extract the data, process it, and store it.\n  A no-code web scraping tool that offers a user-friendly interface for extracting data from websites without needing programming skills.\n  Another no-code web scraper that can handle dynamic content and works with AJAX-loaded sites.\n  A platform that offers a wide range of scraping tools and the ability to create custom scrapers.\n  An AI-powered tool that transforms any web page into personalized APIs instantly, offering advanced data extraction and customization.\n Some platforms provide not only tools for web scraping but also opportunities for developers to share and potentially monetize their scraping solutions. By leveraging these tools and platforms, users can unlock the full potential of web scraping, turning raw data into valuable insights and opportunities.\n \n The legality of web scraping varies across the world. In general, web scraping may be against the   of some websites, but the enforceability of these terms is unclear. \n In the United States, website owners can use three major   to prevent undesired web scraping: (1) copyright infringement (compilation), (2) violation of the   (\"CFAA\"), and (3)  .  However, the effectiveness of these claims relies upon meeting various criteria, and the case law is still evolving. For example, with regard to copyright, while outright duplication of original expression will in many cases be illegal, in the United States the courts ruled in   that duplication of facts is allowable.\n U.S. courts have acknowledged that users of \"scrapers\" or \"robots\" may be held liable for committing  ,  which involves a computer system itself being considered personal property upon which the user of a scraper is trespassing. The best known of these cases,  , resulted in an injunction ordering Bidder's Edge to stop accessing, collecting, and indexing auctions from the eBay web site. This case involved automatic placing of bids, known as  . However, in order to succeed on a claim of trespass to  , the   must demonstrate that the   intentionally and without authorization interfered with the plaintiff's possessory interest in the computer system and that the defendant's unauthorized use caused damage to the plaintiff. Not all cases of web spidering brought before the courts have been considered trespass to chattels. \n One of the first major tests of   involved   (AA), and a firm called FareChase.  AA successfully obtained an   from a Texas trial court, stopping FareChase from selling software that enables users to compare online fares if the software also searches AA's website. The airline argued that FareChase's websearch software trespassed on AA's servers when it collected the publicly available data. FareChase filed an appeal in March 2003. By June, FareChase and AA agreed to settle and the appeal was dropped. \n  has also challenged screen-scraping practices, and has involved both FareChase and another firm, Outtask, in a legal claim. Southwest Airlines charged that the screen-scraping is Illegal since it is an example of \"Computer Fraud and Abuse\" and has led to \"Damage and Loss\" and \"Unauthorized Access\" of Southwest's site. It also constitutes \"Interference with Business Relations\", \"Trespass\", and \"Harmful Access by Computer\". They also claimed that screen-scraping constitutes what is legally known as \"Misappropriation and Unjust Enrichment\", as well as being a breach of the web site's user agreement. Outtask denied all these claims, claiming that the prevailing law, in this case, should be   and that under copyright, the pieces of information being scraped would not be subject to copyright protection. Although the cases were never resolved in the  , FareChase was eventually shuttered by parent company  , and Outtask was purchased by travel expense company Concur. \nIn 2012, a startup called 3Taps scraped classified housing ads from Craigslist. Craigslist sent 3Taps a cease-and-desist letter and blocked their IP addresses and later sued, in  . The court held that the cease-and-desist letter and IP blocking was sufficient for Craigslist to properly claim that 3Taps had violated the   (CFAA).\n Although these are early scraping decisions, and the theories of liability are not uniform, it is difficult to ignore a pattern emerging that the courts are prepared to protect proprietary content on commercial sites from uses which are undesirable to the owners of such sites. However, the degree of protection for such content is not settled and will depend on the type of access made by the scraper, the amount of information accessed and copied, the degree to which the access adversely affects the site owner's system and the types and manner of prohibitions on such conduct. \n While the law in this area becomes more settled, entities contemplating using scraping programs to access a public web site should also consider whether such action is authorized by reviewing the terms of use and other terms or notices posted on or made available through the site. In a 2010 ruling in the   In the United States district court for the eastern district of Virginia, the court ruled that the terms of use should be brought to the users' attention In order for a   contract or license to be enforced.  In a 2014 case, filed in the  ,  e-commerce site   objected to the Pinterest-like shopping aggregator Resultly's 'scraping of QVC's site for real-time pricing data. QVC alleges that Resultly \"excessively crawled\" QVC's retail site (allegedly sending 200-300 search requests to QVC's website per minute, sometimes to up to 36,000 requests per minute) which caused QVC's site to crash for two days, resulting in lost sales for QVC.  QVC's complaint alleges that the defendant disguised its web crawler to mask its source IP address and thus prevented QVC from quickly repairing the problem. This is a particularly interesting scraping case because QVC is seeking damages for the unavailability of their website, which QVC claims was caused by Resultly.\n In the plaintiff's web site during the period of this trial, the terms of use link are displayed among all the links of the site, at the bottom of the page as most sites on the internet. This ruling contradicts the Irish ruling described below. The court also rejected the plaintiff's argument that the browse-wrap restrictions were enforceable in view of Virginia's adoption of the Uniform Computer Information Transactions Act (UCITA)—a uniform law that many believed was in favor on common browse-wrap contracting practices. \n In  , a district court ruled in 2012 that Power Ventures could not scrape Facebook pages on behalf of a Facebook user. The case is on appeal, and the   filed a brief in 2015 asking that it be overturned.  In  , a court in the US held Meltwater liable for scraping and republishing news information from the Associated Press, but a court in the United Kingdom held in favor of Meltwater.\n The   ruled in 2019 that web scraping did not violate the CFAA in  . The case was appealed to the  , which returned the case to the Ninth Circuit to reconsider the case in light of the 2021 Supreme Court decision in   which narrowed the applicability of the CFAA.  On this review, the Ninth Circuit upheld their prior decision. \n  collects and distributes a significant number of publicly available web pages without being considered to be in violation of copyright laws. \n In February 2006, the   (Copenhagen) ruled that systematic crawling, indexing, and deep linking by portal site ofir.dk of real estate site Home.dk does not conflict with Danish law or the database directive of the European Union. \n In a February 2010 case complicated by matters of jurisdiction, Ireland's High Court delivered a verdict that illustrates the   state of developing case law. In the case of  , Ireland's High Court ruled   \" \" agreement to be legally binding. In contrast to the findings of the United States District Court Eastern District of Virginia and those of the Danish Maritime and Commercial Court, Justice   ruled that the hyperlink to Ryanair's terms and conditions was plainly visible, and that placing the onus on the user to agree to terms and conditions in order to gain access to online services is sufficient to comprise a contractual relationship.  The decision is under appeal in Ireland's Supreme Court. \n On April 30, 2020, the French Data Protection Authority (CNIL) released new guidelines on web scraping.  The CNIL guidelines made it clear that publicly available data is still personal data and cannot be repurposed without the knowledge of the person to whom that data belongs. \n In Australia, the   outlaws some forms of web harvesting, although this only applies to email addresses. \n Leaving a few cases dealing with IPR infringement, Indian courts have not expressly ruled on the legality of web scraping. However, since all common forms of electronic contracts are enforceable in India, violating the terms of use prohibiting data scraping will be a violation of the contract law. It will also violate the  , which penalizes unauthorized access to a computer resource or extracting data from a computer resource.\n The administrator of a website can use various measures to stop or slow a bot. Some techniques include:\n"},
{"data": " is an   field concerned with the   of  , as well as the study of appropriate computational approaches to linguistic questions. In general, computational linguistics draws upon  ,  ,  ,  ,  ,  ,  ,  ,  ,   and  , among others.\n The field overlapped with   since the efforts in the United States in the 1950s to use computers to automatically translate texts from foreign languages, particularly Russian scientific journals, into English.  Since rule-based approaches were able to make   (systematic) calculations much faster and more accurately than humans, it was expected that  ,  ,   and   can be learned using explicit rules, as well. After the  ,   coined the term in order to distinguish the field from AI and co-founded both the   and the   (ICCL) in the 1970s and 1980s. What started as an effort to translate between languages evolved into a much wider field of  . \n In order to be able to meticulously study the  , an annotated text corpus was much  needed. The Penn   was one of the most used corpora. It consisted of IBM computer manuals, transcribed telephone conversations, and other texts, together containing over 4.5 million words of American English, annotated using both    tagging and syntactic bracketing. \n Japanese sentence corpora were analyzed and a pattern of   was found in relation to sentence length. \n The fact that during  , children are largely only exposed to positive evidence,  meaning that the only evidence for what is a correct form is provided, and no evidence for what is not correct,  was a limitation for the models at the time because the now available   models were not available in late 1980s. \n It has been shown that languages can be learned with a combination of simple input presented incrementally as the child develops better memory and longer attention span,  which explained the long period of   in human infants and children. \n Robots have been used to test linguistic theories.  Enabled to learn as children might, models were created based on an   model in which mappings between actions, perceptions, and effects were created and linked to spoken words. Crucially, these robots were able to acquire functioning word-to-meaning mappings without needing grammatical structure.\n Using the   and   dynamics, researchers have created a system which not only predicts future linguistic evolution but also gives insight into the evolutionary history of modern-day languages. \n Chomsky's theories have influenced computational linguistics, particularly in understanding how infants learn complex grammatical structures, such as those described in  .  Attempts have been made to determine how an infant learns a \"non-normal grammar\" as theorized by Chomsky normal form.  Research in this area combines structural approaches with computational models to analyze large   like the Penn  , helping to uncover patterns in language acquisition. \n"},
{"data": " ( ) is an   subfield of   and  . It is primarily concerned with providing computers with the ability to process data encoded in   and is thus closely related to  ,   and  , a subfield of  . Typically data is collected in  , using either rule-based, statistical or neural-based approaches in   and  .\n Major tasks in natural language processing are  ,  ,  , and  .\n Natural language processing has its roots in the 1950s.  Already in 1950,   published an article titled \" \" which proposed what is now called the   as a criterion of intelligence, though at the time that was not articulated as a problem separate from artificial intelligence. The proposed test includes a task that involves the automated interpretation and generation of natural language.\n The premise of symbolic NLP is well-summarized by  's   experiment: Given a collection of rules (e.g., a Chinese phrasebook, with questions and matching answers), the computer emulates natural language understanding (or other NLP tasks) by applying those rules to the data it confronts.\n Up until the 1980s, most natural language processing systems were based on complex sets of hand-written rules.  Starting in the late 1980s, however, there was a revolution in natural language processing with the introduction of   algorithms for language processing.  This was due to both the steady increase in computational power (see  ) and the gradual lessening of the dominance of   theories of linguistics (e.g.  ), whose theoretical underpinnings discouraged the sort of   that underlies the machine-learning approach to language processing.  \n In 2003,  , at the time the best statistical algorithm, was outperformed by a   (with a single hidden layer and context length of several words trained on up to 14 million of words with a CPU cluster in  ) by   with co-authors.  \n In 2010,   (then a PhD student at  ) with co-authors applied a simple   with a single hidden layer to language modelling,  and in the following years he went on to develop  . In the 2010s,   and  -style (featuring many hidden layers) machine learning methods became widespread in natural language processing. That popularity was due partly to a flurry of results showing that such techniques  can achieve state-of-the-art results in many natural language tasks, e.g., in   and parsing.  This is increasingly important  , where NLP helps analyze notes and text in   that would otherwise be inaccessible for study when seeking to improve care  or protect patient privacy. \n Symbolic approach, i.e., the hand-coding of a set of rules for manipulating symbols, coupled with a dictionary lookup, was historically the first approach used both by AI in general and by NLP in particular:  such as by writing grammars or devising heuristic rules for  .\n  approaches, which include both statistical and neural networks, on the other hand, have many advantages over the symbolic approach: \n Although rule-based systems for manipulating symbols were still in use in 2020, they have become mostly obsolete with the advance of   in 2023. \n Before that they were commonly used:\n In the late 1980s and mid-1990s, the statistical approach ended a period of  , which was caused by the inefficiencies of the rule-based approaches. \n The earliest  , producing systems of hard  , were still very similar to the old rule-based approaches.\nOnly the introduction of hidden  , applied to part-of-speech tagging, announced the end of the old rule-based approach.\n A major drawback of statistical methods is that they require elaborate  . Since 2015,  the statistical approach has been replaced by the   approach, using   and   to capture semantic properties of words.  \n Intermediate tasks (e.g., part-of-speech tagging and dependency parsing) are not needed anymore. \n , based on then-newly-invented   transformations, made obsolete the intermediate steps, such as word alignment, previously necessary for  .\n The following is a list of some of the most commonly researched tasks in natural language processing. Some of these tasks have direct real-world applications, while others more commonly serve as subtasks that are used to aid in solving larger tasks.\n Though natural language processing tasks are closely intertwined, they can be subdivided into categories for convenience. A coarse division is given below.\n Based on long-standing trends in the field, it is possible to extrapolate future directions of NLP. As of 2020, three trends among the topics of the long-standing series of CoNLL Shared Tasks can be observed: \n Most higher-level NLP applications involve aspects that emulate intelligent behaviour and apparent comprehension of natural language. More broadly speaking, the technical operationalization of increasingly advanced aspects of cognitive behaviour represents one of the developmental trajectories of NLP (see trends among CoNLL shared tasks above).\n  refers to \"the mental action or process of acquiring knowledge and understanding through thought, experience, and the senses.\"    is the interdisciplinary, scientific study of the mind and its processes.    is an interdisciplinary branch of linguistics, combining knowledge and research from both psychology and linguistics.  Especially during the age of  , the area of computational linguistics maintained strong ties with cognitive studies.\n As an example,   offers a methodology to build natural language processing (NLP) algorithms through the perspective of cognitive science, along with the findings of cognitive linguistics,  with two defining aspects:\n Ties with cognitive linguistics are part of the historical heritage of NLP, but they have been less frequently addressed since the statistical turn during the 1990s. Nevertheless, approaches to develop cognitive models towards technically operationalizable frameworks have been pursued in the context of various frameworks, e.g., of cognitive grammar,  functional grammar,  construction grammar,  computational psycholinguistics and cognitive neuroscience (e.g.,  ), however, with limited uptake in mainstream NLP (as measured by presence on major conferences  of the  ). More recently, ideas of cognitive NLP have been revived as an approach to achieve  , e.g., under the notion of \"cognitive AI\".  Likewise, ideas of cognitive NLP are inherent to neural models   NLP (although rarely made explicit)  and developments in  , specifically tools and technologies using   approaches  and new directions in   based on the   by British neuroscientist and theoretician at University College London  .\n"},
{"data": " ( ) is a   in   concerned with the development and study of   that can learn from   and   to unseen data, and thus perform   without explicit  .  Recently,   have been able to surpass many previous approaches in performance. \n ML finds application in many fields, including  ,  ,  ,  ,  , and  .  The application of ML to business problems is known as  .\n  and   (mathematical programming) methods comprise the foundations of machine learning.   is a related field of study, focusing on   (EDA) via  .  \n From a theoretical viewpoint,   provides a framework for describing machine learning.\n The term   was coined in 1959 by  , an   employee and pioneer in the field of   and  .  The synonym   was also used in this time period. \n Although the earliest machine learning model was introduced in the 1950s when   invented a   that calculated the winning chance in checkers for each side, the history of machine learning roots back to decades of human desire and effort to study human cognitive processes.  In 1949,   psychologist   published the book  , in which he introduced a   formed by certain interactions among  .  Hebb's model of   interacting with one another set a groundwork for how AIs and machine learning algorithms work under nodes, or   used by computers to communicate data.  Other researchers who have studied human cognitive systems contributed to the modern machine learning technologies as well, including logician   and  , who proposed the early mathematical models of neural networks to come up with algorithms that mirror human thought processes. \n By the early 1960s, an experimental \"learning machine\" with   memory, called Cybertron, had been developed by   to analyze   signals,  , and speech patterns using rudimentary  . It was repetitively \"trained\" by a human operator/teacher to recognize patterns and equipped with a \" \" button to cause it to reevaluate incorrect decisions.  A representative book on research into machine learning during the 1960s was Nilsson's book on Learning Machines, dealing mostly with machine learning for pattern classification.  Interest related to pattern recognition continued into the 1970s, as described by Duda and Hart in 1973.  In 1981 a report was given on using teaching strategies so that an   learns to recognize 40 characters (26 letters, 10 digits, and 4 special symbols) from a computer terminal. \n  provided a widely quoted, more formal definition of the algorithms studied in the machine learning field: \"A computer program is said to learn from experience   with respect to some class of tasks   and performance measure   if its performance at tasks in  , as measured by  ,  improves with experience  .\"  This definition of the tasks in which machine learning is concerned offers a fundamentally   rather than defining the field in cognitive terms. This follows  's proposal in his paper \" \", in which the question \"Can machines think?\" is replaced with the question \"Can machines do what we (as thinking entities) can do?\". \n Modern-day machine learning has two objectives.  One is to classify data based on models which have been developed; the other purpose is to make predictions for future outcomes based on these models. A hypothetical algorithm specific to classifying data may use computer vision of moles coupled with supervised learning in order to train it to classify the cancerous moles. A machine learning algorithm for stock trading may inform the trader of future potential predictions. \n As a scientific endeavor, machine learning grew out of the quest for   (AI). In the early days of AI as an  , some researchers were interested in having machines learn from data. They attempted to approach the problem with various symbolic methods, as well as what were then termed \" \"; these were mostly   and   that were later found to be reinventions of the   of statistics.    was also employed, especially in  . \n However, an increasing emphasis on the   caused a rift between AI and machine learning. Probabilistic systems were plagued by theoretical and practical problems of data acquisition and representation.  By 1980,   had come to dominate AI, and statistics was out of favor.  Work on symbolic/knowledge-based learning did continue within AI, leading to  (ILP), but the more statistical line of research was now outside the field of AI proper, in   and  .  Neural networks research had been abandoned by AI and   around the same time. This line, too, was continued outside the AI/CS field, as \" \", by researchers from other disciplines including  ,  , and  . Their main success came in the mid-1980s with the reinvention of  . \n Machine learning (ML), reorganized and recognized as its own field, started to flourish in the 1990s. The field changed its goal from achieving artificial intelligence to tackling solvable problems of a practical nature. It shifted focus away from the   it had inherited from AI, and toward methods and models borrowed from statistics,  , and  . \n There is a close connection between machine learning and compression. A system that predicts the   of a sequence given its entire history can be used for optimal data compression (by using   on the output distribution). Conversely, an optimal compressor can be used for prediction (by finding the symbol that compresses best, given the previous history). This equivalence has been used as a justification for using data compression as a benchmark for \"general intelligence\". \n An alternative view can show compression algorithms implicitly map strings into implicit  , and compression-based similarity measures compute similarity within these feature spaces. For each compressor C(.) we define an associated vector space ℵ, such that C(.) maps an input string x, corresponding to the vector norm ||~x||. An exhaustive examination of the feature spaces underlying all compression algorithms is precluded by space; instead, feature vectors chooses to examine three representative lossless compression methods, LZW, LZ77, and PPM. \n According to   theory, a connection more directly explained in  , the best possible compression of x is the smallest possible software that generates x. For example, in that model, a zip file's compressed size includes both the zip file and the unzipping software, since you can not unzip it without both, but there may be an even smaller combined form.\n Examples of AI-powered audio/video compression software include  , AIVC.  Examples of software that can perform AI-powered image compression include  ,  ,  's Image Processing Toolbox (IPT) and High-Fidelity Generative Image Compression. \n In  ,   can be utilized to compress data by grouping similar data points into clusters. This technique simplifies handling extensive datasets that lack predefined labels and finds widespread use in fields such as  . \n Data compression aims to reduce the size of data files, enhancing storage efficiency and speeding up data transmission. K-means clustering, an unsupervised machine learning algorithm, is employed to partition a dataset into a specified number of clusters, k, each represented by the   of its points. This process condenses extensive datasets into a more compact set of representative points. Particularly beneficial in   and  , k-means clustering aids in data reduction by replacing groups of data points with their centroids, thereby preserving the core information of the original data while significantly decreasing the required storage space. \n Machine learning and   often employ the same methods and overlap significantly, but while machine learning focuses on prediction, based on   properties learned from the training data, data mining focuses on the   of (previously)   properties in the data (this is the analysis step of   in databases). Data mining uses many machine learning methods, but with different goals; on the other hand, machine learning also employs data mining methods as \" \" or as a preprocessing step to improve learner accuracy. Much of the confusion between these two research communities (which do often have separate conferences and separate journals,   being a major exception) comes from the basic assumptions they work with: in machine learning, performance is usually evaluated with respect to the ability to   knowledge, while in knowledge discovery and data mining (KDD) the key task is the discovery of previously   knowledge. Evaluated with respect to known knowledge, an uninformed (unsupervised) method will easily be outperformed by other supervised methods, while in a typical KDD task, supervised methods cannot be used due to the unavailability of training data.\n Machine learning also has intimate ties to  : Many learning problems are formulated as minimization of some   on a training set of examples. Loss functions express the discrepancy between the predictions of the model being trained and the actual problem instances (for example, in classification, one wants to assign a label to instances, and models are trained to correctly predict the preassigned labels of a set of examples). \n Characterizing the generalization of various learning algorithms is an active topic of current research, especially for   algorithms.\n Machine learning and   are closely related fields in terms of methods, but distinct in their principal goal: statistics draws population   from a  , while machine learning finds generalizable predictive patterns.  According to  , the ideas of machine learning, from methodological principles to theoretical tools, have had a long pre-history in statistics.  He also suggested the term   as a placeholder to call the overall field. \n Conventional statistical analyses require the a priori selection of a model most suitable for the study data set. In addition, only significant or theoretically relevant variables based on previous experience are included for analysis. In contrast, machine learning is not built on a pre-structured model; rather, the data shape the model by detecting underlying patterns. The more variables (input) used to train the model, the more accurate the ultimate model will be. \n  distinguished two statistical modeling paradigms: data model and algorithmic model,  wherein \"algorithmic model\" means more or less the machine learning algorithms like  .\n Some statisticians have adopted methods from machine learning, leading to a combined field that they call  . \n Analytical and computational techniques derived from deep-rooted physics of disordered systems can be extended to large-scale problems, including machine learning, e.g., to analyze the weight space of  .  Statistical physics is thus finding applications in the area of  . \n A core objective of a learner is to generalize from its experience.  Generalization in this context is the ability of a learning machine to perform accurately on new, unseen examples/tasks after having experienced a learning data set. The training examples come from some generally unknown probability distribution (considered representative of the space of occurrences) and the learner has to build a general model about this space that enables it to produce sufficiently accurate predictions in new cases.\n The computational analysis of machine learning algorithms and their performance is a branch of   known as   via the   (PAC) model. Because training sets are finite and the future is uncertain, learning theory usually does not yield guarantees of the performance of algorithms. Instead, probabilistic bounds on the performance are quite common. The   is one way to quantify generalization  .\n For the best performance in the context of generalization, the complexity of the hypothesis should match the complexity of the function underlying the data. If the hypothesis is less complex than the function, then the model has under fitted the data. If the complexity of the model is increased in response, then the training error decreases. But if the hypothesis is too complex, then the model is subject to   and generalization will be poorer. \n In addition to performance bounds, learning theorists study the time complexity and feasibility of learning. In computational learning theory, a computation is considered feasible if it can be done in  . There are two kinds of   results: Positive results show that a certain class of functions can be learned in polynomial time. Negative results show that certain classes cannot be learned in polynomial time.\n \nMachine learning approaches are traditionally divided into three broad categories, which correspond to learning paradigms, depending on the nature of the \"signal\" or \"feedback\" available to the learning system:\n Although each algorithm has advantages and limitations, no single algorithm works for all problems. \n Supervised learning algorithms build a mathematical model of a set of data that contains both the inputs and the desired outputs.  The data, known as  , consists of a set of training examples. Each training example has one or more inputs and the desired output, also known as a supervisory signal. In the mathematical model, each training example is represented by an   or vector, sometimes called a  , and the training data is represented by a  . Through   of an  , supervised learning algorithms learn a function that can be used to predict the output associated with new inputs.  An optimal function allows the algorithm to correctly determine the output for inputs that were not a part of the training data. An algorithm that improves the accuracy of its outputs or predictions over time is said to have learned to perform that task. \n Types of supervised-learning algorithms include  ,   and  .  Classification algorithms are used when the outputs are restricted to a limited set of values, and regression algorithms are used when the outputs may have any numerical value within a range. As an example, for a classification algorithm that filters emails, the input would be an incoming email, and the output would be the name of the folder in which to file the email. Examples of regression would be predicting the height of a person, or the future temperature.  \n  is an area of supervised machine learning closely related to regression and classification, but the goal is to learn from examples using a similarity function that measures how similar or related two objects are. It has applications in  ,  , visual identity tracking, face verification, and speaker verification.\n Unsupervised learning algorithms find structures in data that has not been labeled, classified or categorized. Instead of responding to feedback, unsupervised learning algorithms identify commonalities in the data and react based on the presence or absence of such commonalities in each new piece of data. Central applications of unsupervised machine learning include clustering,  ,  and  .  Unsupervised learning algorithms also streamlined the process of identifying large   based   of a gene of interest from  .   \n Cluster analysis is the assignment of a set of observations into subsets (called  ) so that observations within the same cluster are similar according to one or more predesignated criteria, while observations drawn from different clusters are dissimilar. Different clustering techniques make different assumptions on the structure of the data, often defined by some   and evaluated, for example, by  , or the similarity between members of the same cluster, and  , the difference between clusters. Other methods are based on   and  .\n A special type of unsupervised learning called,   involves training a model by generating the supervisory signal from the data itself. \n Semi-supervised learning falls between   (without any labeled training data) and   (with completely labeled training data). Some of the training examples are missing training labels, yet many machine-learning researchers have found that unlabeled data, when used in conjunction with a small amount of labeled data, can produce a considerable improvement in learning accuracy.\n In  , the training labels are noisy, limited, or imprecise; however, these labels are often cheaper to obtain, resulting in larger effective training sets. \n Reinforcement learning is an area of machine learning concerned with how   ought to take   in an environment so as to maximize some notion of cumulative reward. Due to its generality, the field is studied in many other disciplines, such as  ,  ,  ,  ,  ,  ,  ,   and  . In reinforcement learning, the environment is typically represented as a   (MDP). Many reinforcements learning algorithms use   techniques.  Reinforcement learning algorithms do not assume knowledge of an exact mathematical model of the MDP and are used when exact models are infeasible. Reinforcement learning algorithms are used in autonomous vehicles or in learning to play a game against a human opponent.\n  is a process of reducing the number of random variables under consideration by obtaining a set of principal variables.  In other words, it is a process of reducing the dimension of the   set, also called the \"number of features\". Most of the dimensionality reduction techniques can be considered as either feature elimination or  . One of the popular methods of dimensionality reduction is   (PCA). PCA involves changing higher-dimensional data (e.g., 3D) to a smaller space (e.g., 2D).\nThe   proposes that high-dimensional data sets lie along low-dimensional  , and many dimensionality reduction techniques make this assumption, leading to the area of   and  .\n Other approaches have been developed which do not fit neatly into this three-fold categorization, and sometimes more than one is used by the same machine learning system. For example,  ,  . \n Self-learning, as a machine learning paradigm was introduced in 1982 along with a neural network capable of self-learning, named   (CAA).  It is learning with no external rewards and no external teacher advice. The CAA self-learning algorithm computes, in a crossbar fashion, both decisions about actions and emotions (feelings) about consequence situations. The system is driven by the interaction between cognition and emotion. \nThe self-learning algorithm updates a memory matrix W =||w(a,s)|| such that in each iteration executes the following machine learning routine: \n It is a system with only one input, situation, and only one output, action (or behavior) a. There is neither a separate reinforcement input nor an advice input from the environment. The backpropagated value (secondary reinforcement) is the emotion toward the consequence situation. The CAA exists in two environments, one is the behavioral environment where it behaves, and the other is the genetic environment, wherefrom it initially and only once receives initial emotions about situations to be encountered in the behavioral environment. After receiving the genome (species) vector from the genetic environment, the CAA learns a goal-seeking behavior, in an environment that contains both desirable and undesirable situations. \n Several learning algorithms aim at discovering better representations of the inputs provided during training.  Classic examples include   and cluster analysis. Feature learning algorithms, also called representation learning algorithms, often attempt to preserve the information in their input but also transform it in a way that makes it useful, often as a pre-processing step before performing classification or predictions. This technique allows reconstruction of the inputs coming from the unknown data-generating distribution, while not being necessarily faithful to configurations that are implausible under that distribution. This replaces manual  , and allows a machine to both learn the features and use them to perform a specific task.\n Feature learning can be either supervised or unsupervised. In supervised feature learning, features are learned using labeled input data. Examples include  ,  , and supervised  . In unsupervised feature learning, features are learned with unlabeled input data.  Examples include dictionary learning,  ,  ,   and various forms of  . \n  algorithms attempt to do so under the constraint that the learned representation is low-dimensional.   algorithms attempt to do so under the constraint that the learned representation is sparse, meaning that the mathematical model has many zeros.   algorithms aim to learn low-dimensional representations directly from   representations for multidimensional data, without reshaping them into higher-dimensional vectors.    algorithms discover multiple levels of representation, or a hierarchy of features, with higher-level, more abstract features defined in terms of (or generating) lower-level features. It has been argued that an intelligent machine is one that learns a representation that disentangles the underlying factors of variation that explain the observed data. \n Feature learning is motivated by the fact that machine learning tasks such as classification often require input that is mathematically and computationally convenient to process. However, real-world data such as images, video, and sensory data has not yielded attempts to algorithmically define specific features. An alternative is to discover such features or representations through examination, without relying on explicit algorithms.\n Sparse dictionary learning is a feature learning method where a training example is represented as a linear combination of   and assumed to be a  . The method is   and difficult to solve approximately.  A popular   method for sparse dictionary learning is the   algorithm. Sparse dictionary learning has been applied in several contexts. In classification, the problem is to determine the class to which a previously unseen training example belongs. For a dictionary where each class has already been built, a new training example is associated with the class that is best sparsely represented by the corresponding dictionary. Sparse dictionary learning has also been applied in  . The key idea is that a clean image patch can be sparsely represented by an image dictionary, but the noise cannot. \n In  , anomaly detection, also known as outlier detection, is the identification of rare items, events or observations which raise suspicions by differing significantly from the majority of the data.  Typically, the anomalous items represent an issue such as  , a structural defect, medical problems or errors in a text. Anomalies are referred to as  , novelties, noise, deviations and exceptions. \n In particular, in the context of abuse and network intrusion detection, the interesting objects are often not rare objects, but unexpected bursts of inactivity. This pattern does not adhere to the common statistical definition of an outlier as a rare object. Many outlier detection methods (in particular, unsupervised algorithms) will fail on such data unless aggregated appropriately. Instead, a cluster analysis algorithm may be able to detect the micro-clusters formed by these patterns. \n Three broad categories of anomaly detection techniques exist.  Unsupervised anomaly detection techniques detect anomalies in an unlabeled test data set under the assumption that the majority of the instances in the data set are normal, by looking for instances that seem to fit the least to the remainder of the data set. Supervised anomaly detection techniques require a data set that has been labeled as \"normal\" and \"abnormal\" and involves training a classifier (the key difference from many other statistical classification problems is the inherently unbalanced nature of outlier detection). Semi-supervised anomaly detection techniques construct a model representing normal behavior from a given normal training data set and then test the likelihood of a test instance to be generated by the model.\n  is inspired by a multitude of machine learning methods, starting from supervised learning, reinforcement learning,  and finally   (e.g. MAML).\n Association rule learning is a   method for discovering relationships between variables in large databases. It is intended to identify strong rules discovered in databases using some measure of \"interestingness\". \n Rule-based machine learning is a general term for any machine learning method that identifies, learns, or evolves \"rules\" to store, manipulate or apply knowledge. The defining characteristic of a rule-based machine learning algorithm is the identification and utilization of a set of relational rules that collectively represent the knowledge captured by the system. This is in contrast to other machine learning algorithms that commonly identify a singular model that can be universally applied to any instance in order to make a prediction.  Rule-based machine learning approaches include  , association rule learning, and  .\n Based on the concept of strong rules,  ,   and Arun Swami introduced association rules for discovering regularities between products in large-scale transaction data recorded by   (POS) systems in supermarkets.  For example, the rule   found in the sales data of a supermarket would indicate that if a customer buys onions and potatoes together, they are likely to also buy hamburger meat. Such information can be used as the basis for decisions about marketing activities such as promotional   or  . In addition to  , association rules are employed today in application areas including  ,  ,  , and  . In contrast with  , association rule learning typically does not consider the order of items either within a transaction or across transactions.\n Learning classifier systems (LCS) are a family of rule-based machine learning algorithms that combine a discovery component, typically a  , with a learning component, performing either  ,  , or  . They seek to identify a set of context-dependent rules that collectively store and apply knowledge in a   manner in order to make predictions. \n  (ILP) is an approach to rule learning using   as a uniform representation for input examples, background knowledge, and hypotheses. Given an encoding of the known background knowledge and a set of examples represented as a logical database of facts, an ILP system will derive a hypothesized logic program that   all positive and no negative examples.   is a related field that considers any kind of programming language for representing hypotheses (and not only logic programming), such as  .\n Inductive logic programming is particularly useful in   and  .   and   laid the initial theoretical foundation for inductive machine learning in a logical setting.  Shapiro built their first implementation (Model Inference System) in 1981: a Prolog program that inductively inferred logic programs from positive and negative examples.  The term   here refers to   induction, suggesting a theory to explain observed facts, rather than  , proving a property for all members of a well-ordered set.\n A   is a type of   that, after being \"trained\" on a given dataset, can be used to make predictions or classifications on new data. During training, a learning algorithm iteratively adjusts the model's internal parameters to minimize errors in its predictions.  By extension, the term \"model\" can refer to several levels of specificity, from a general class of models and their associated learning algorithms to a fully trained model with all its internal parameters tuned. \n Various types of models have been used and researched for machine learning systems, picking the best model for a task is called  .\n Artificial neural networks (ANNs), or   systems, are computing systems vaguely inspired by the   that constitute animal  . Such systems \"learn\" to perform tasks by considering examples, generally without being programmed with any task-specific rules.\n An ANN is a model based on a collection of connected units or nodes called \" \", which loosely model the   in a biological brain. Each connection, like the   in a biological brain, can transmit information, a \"signal\", from one artificial neuron to another. An artificial neuron that receives a signal can process it and then signal additional artificial neurons connected to it. In common ANN implementations, the signal at a connection between artificial neurons is a  , and the output of each artificial neuron is computed by some non-linear function of the sum of its inputs. The connections between artificial neurons are called \"edges\". Artificial neurons and edges typically have a   that adjusts as learning proceeds. The weight increases or decreases the strength of the signal at a connection. Artificial neurons may have a threshold such that the signal is only sent if the aggregate signal crosses that threshold. Typically, artificial neurons are aggregated into layers. Different layers may perform different kinds of transformations on their inputs. Signals travel from the first layer (the input layer) to the last layer (the output layer), possibly after traversing the layers multiple times.\n The original goal of the ANN approach was to solve problems in the same way that a   would. However, over time, attention moved to performing specific tasks, leading to deviations from  . Artificial neural networks have been used on a variety of tasks, including  ,  ,  ,   filtering,   and  .\n  consists of multiple hidden layers in an artificial neural network. This approach tries to model the way the human brain processes light and sound into vision and hearing. Some successful applications of deep learning are computer vision and speech recognition. \n Decision tree learning uses a   as a   to go from observations about an item (represented in the branches) to conclusions about the item's target value (represented in the leaves). It is one of the predictive modeling approaches used in statistics, data mining, and machine learning. Tree models where the target variable can take a discrete set of values are called classification trees; in these tree structures,   represent class labels, and branches represent   of features that lead to those class labels. Decision trees where the target variable can take continuous values (typically  ) are called regression trees. In decision analysis, a decision tree can be used to visually and explicitly represent decisions and  . In data mining, a decision tree describes data, but the resulting classification tree can be an input for decision-making.\n Support-vector machines (SVMs), also known as support-vector networks, are a set of related   methods used for classification and regression. Given a set of training examples, each marked as belonging to one of two categories, an SVM training algorithm builds a model that predicts whether a new example falls into one category.  An SVM training algorithm is a non- ,  ,  , although methods such as   exist to use SVM in a probabilistic classification setting. In addition to performing linear classification, SVMs can efficiently perform a non-linear classification using what is called the  , implicitly mapping their inputs into high-dimensional feature spaces.\n Regression analysis encompasses a large variety of statistical methods to estimate the relationship between input variables and their associated features. Its most common form is  , where a single line is drawn to best fit the given data according to a mathematical criterion such as  . The latter is often extended by   methods to mitigate overfitting and bias, as in  . When dealing with non-linear problems, go-to models include   (for example, used for trendline fitting in Microsoft Excel ),   (often used in  ) or even  , which introduces non-linearity by taking advantage of the   to implicitly map input variables to higher-dimensional space.\n A Bayesian network, belief network, or directed acyclic graphical model is a probabilistic   that represents a set of   and their   with a   (DAG). For example, a Bayesian network could represent the probabilistic relationships between diseases and symptoms. Given symptoms, the network can be used to compute the probabilities of the presence of various diseases. Efficient algorithms exist that perform   and learning. Bayesian networks that model sequences of variables, like   or  , are called  . Generalizations of Bayesian networks that can represent and solve decision problems under uncertainty are called  .\n A Gaussian process is a   in which every finite collection of the random variables in the process has a  , and it relies on a pre-defined  , or kernel, that models how pairs of points relate to each other depending on their locations.\n Given a set of observed points, or input–output examples, the distribution of the (unobserved) output of a new point as function of its input data can be directly computed by looking like the observed points and the covariances between those points and the new, unobserved point.\n Gaussian processes are popular surrogate models in   used to do  .\n A genetic algorithm (GA) is a   and   technique that mimics the process of  , using methods such as   and   to generate new   in the hope of finding good solutions to a given problem. In machine learning, genetic algorithms were used in the 1980s and 1990s.  Conversely, machine learning techniques have been used to improve the performance of genetic and  . \n The theory of belief functions, also referred to as evidence theory or Dempster–Shafer theory, is a general framework for reasoning with uncertainty, with understood connections to other frameworks such as  ,   and   . These theoretical frameworks can be thought of as a kind of learner and have some analogous properties of how evidence is combined (e.g.,  Dempster's rule of combination), just like how in a  -based Bayesian approach  would combine probabilities. However, there are many caveats to these beliefs functions when compared to Bayesian approaches in order to incorporate ignorance and  . These belief function approaches that are implemented within the machine learning domain typically leverage a fusion approach of various   to better handle the learner's  , low samples, and ambiguous class issues that standard machine learning approach tend to have difficulty resolving.  However, the computational complexity of these algorithms are dependent on the number of propositions (classes), and can lead to a much higher computation time when compared to other machine learning approaches.\n Typically, machine learning models require a high quantity of reliable data to perform accurate predictions. When training a machine learning model, machine learning engineers need to target and collect a large and representative   of data. Data from the training set can be as varied as a  , a collection of images,   data, and data collected from individual users of a service.   is something to watch out for when training a machine learning model. Trained models derived from biased or non-evaluated data can result in skewed or undesired predictions. Biased models may result in detrimental outcomes, thereby furthering the negative impacts on society or objectives.   is a potential result of data not being fully prepared for training. Machine learning ethics is becoming a field of study and notably, becoming integrated within machine learning engineering teams.\n Federated learning is an adapted form of   to training machine learning models that decentralizes the training process, allowing for users' privacy to be maintained by not needing to send their data to a centralized server. This also increases efficiency by decentralizing the training process to many devices. For example,   uses federated machine learning to train search query prediction models on users' mobile phones without having to send individual searches back to  . \n There are many applications for machine learning, including:\n In 2006, the media-services provider   held the first \" \" competition to find a program to better predict user preferences and improve the accuracy of its existing Cinematch movie recommendation algorithm by at least 10%. A joint team made up of researchers from  -Research in collaboration with the teams Big Chaos and Pragmatic Theory built an   to win the Grand Prize in 2009 for $1 million.  Shortly after the prize was awarded, Netflix realized that viewers' ratings were not the best indicators of their viewing patterns (\"everything is a recommendation\") and they changed their recommendation engine accordingly.  In 2010 The Wall Street Journal wrote about the firm Rebellion Research and their use of machine learning to predict the financial crisis.  In 2012, co-founder of  ,  , predicted that 80% of medical doctors jobs would be lost in the next two decades to automated machine learning medical diagnostic software.  In 2014, it was reported that a machine learning algorithm had been applied in the field of art history to study fine art paintings and that it may have revealed previously unrecognized influences among artists.  In 2019   published the first research book created using machine learning.  In 2020, machine learning technology was used to help make diagnoses and aid researchers in developing a cure for COVID-19.  Machine learning was recently applied to predict the pro-environmental behavior of travelers.  Recently, machine learning technology was also applied to optimize smartphone's performance and thermal behavior based on the user's interaction with the phone.  When applied correctly, machine learning algorithms (MLAs) can utilize a wide range of company characteristics to predict stock returns without  . By employing effective feature engineering and combining forecasts, MLAs can generate results that far surpass those obtained from basic linear techniques like  . \n Recent advancements in machine learning have extended into the field of quantum chemistry, where novel algorithms now enable the prediction of solvent effects on chemical reactions, thereby offering new tools for chemists to tailor experimental conditions for optimal outcomes. \n Machine Learning is becoming a useful tool to investigate and predict evacuation decision making in large scale and small scale disasters. Different solutions have been tested to predict if and when householders decide to evacuate during wildfires and hurricanes.  Other applications have been focusing on pre evacuation decisions in building fires. \n Although machine learning has been transformative in some fields, machine-learning programs often fail to deliver expected results.  Reasons for this are numerous: lack of (suitable) data, lack of access to the data, data bias, privacy problems, badly chosen tasks and algorithms, wrong tools and people, lack of resources, and evaluation problems. \n The \" \" poses another yet significant challenge. Black box refers to a situation where the algorithm or the process of producing an output is entirely opaque, meaning that even the coders of the algorithm cannot audit the pattern that the machine extracted out of the data.  The House of Lords Select Committee, which claimed that such an \"intelligence system\" that could have a \"substantial impact on an individual’s life\" would not be considered acceptable unless it provided \"a full and satisfactory explanation for the decisions\" it makes. \n In 2018, a self-driving car from   failed to detect a pedestrian, who was killed after a collision.  Attempts to use machine learning in healthcare with the   system failed to deliver even after years of time and billions of dollars invested.  Microsoft's   chatbot has been reported to produce hostile and offensive response against its users. \n Machine learning has been used as a strategy to update the evidence related to a systematic review and increased reviewer burden related to the growth of biomedical literature. While it has improved with training sets, it has not yet developed sufficiently to reduce the workload burden without limiting the necessary sensitivity for the findings research themselves. \n Different machine learning approaches can suffer from different data biases. A machine learning system trained specifically on current customers may not be able to predict the needs of new customer groups that are not represented in the training data. When trained on human-made data, machine learning is likely to pick up the constitutional and unconscious biases already present in society. \n Language models learned from data have been shown to contain human-like biases.  In an experiment carried out by  , an   organization, a machine learning algorithm's insight into the recidivism rates among prisoners falsely flagged \"black defendants high risk twice as often as white defendants.\"  In 2015, Google Photos would often tag black people as gorillas,  and in 2018, this still was not well resolved, but Google reportedly was still using the workaround to remove all gorillas from the training data and thus was not able to recognize real gorillas at all.  Similar issues with recognizing non-white people have been found in many other systems.  In 2016, Microsoft tested  , a   that learned from Twitter, and it quickly picked up racist and sexist language. \n Because of such challenges, the effective use of machine learning may take longer to be adopted in other domains.  Concern for   in machine learning, that is, reducing bias in machine learning and propelling its use for human good, is increasingly expressed by artificial intelligence scientists, including  , who reminds engineers that \"[t]here's nothing artificial about AI. It's inspired by people, it's created by people, and—most importantly—it impacts people. It is a powerful tool we are only just beginning to understand, and that is a profound responsibility.\" \n Explainable AI (XAI), or Interpretable AI, or Explainable Machine Learning (XML), is artificial intelligence (AI) in which humans can understand the decisions or predictions made by the AI.  It contrasts with the \"black box\" concept in machine learning where even its designers cannot explain why an AI arrived at a specific decision.  By refining the mental models of users of AI-powered systems and dismantling their misconceptions, XAI promises to help users perform more effectively. XAI may be an implementation of the social right to explanation.\n Settling on a bad, overly complex theory gerrymandered to fit all the past training data is known as overfitting. Many systems attempt to reduce overfitting by rewarding a theory in accordance with how well it fits the data but penalizing the theory in accordance with how complex the theory is. \n Learners can also disappoint by \"learning the wrong lesson\". A toy example is that an image classifier trained only on pictures of brown horses and black cats might conclude that all brown patches are likely to be horses.  A real-world example is that, unlike humans, current image classifiers often do not primarily make judgments from the spatial relationship between components of the picture, and they learn relationships between pixels that humans are oblivious to, but that still correlate with images of certain types of real objects. Modifying these patterns on a legitimate image can result in \"adversarial\" images that the system misclassifies. \n Adversarial vulnerabilities can also result in nonlinear systems, or from non-pattern perturbations. For some systems, it is possible to change the output by only changing a single adversarially chosen pixel.  Machine learning models are often vulnerable to manipulation and/or evasion via  . \n Researchers have demonstrated how   can be placed undetectably into classifying (e.g., for categories \"spam\" and well-visible \"not spam\" of posts) machine learning models that are often developed and/or trained by third parties. Parties can change the classification of any input, including in cases for which a type of   is provided, possibly including  . \n Classification of machine learning models can be validated by accuracy estimation techniques like the   method, which splits the data in a training and test set (conventionally 2/3 training set and 1/3 test set designation) and evaluates the performance of the training model on the test set. In comparison, the K-fold-  method randomly partitions the data into K subsets and then K experiments are performed each respectively considering 1 subset for evaluation and the remaining K-1 subsets for training the model. In addition to the holdout and cross-validation methods,  , which samples n instances with replacement from the dataset, can be used to assess model accuracy. \n In addition to overall accuracy, investigators frequently report   meaning True Positive Rate (TPR) and True Negative Rate (TNR) respectively. Similarly, investigators sometimes report the   (FPR) as well as the   (FNR). However, these rates are ratios that fail to reveal their numerators and denominators. The   (TOC) is an effective method to express a model's diagnostic ability. TOC shows the numerators and denominators of the previously mentioned rates, thus TOC provides more information than the commonly used   (ROC) and ROC's associated area under the curve (AUC). \n Machine learning poses a host of  . Systems that are trained on datasets collected with biases may exhibit these biases upon use ( ), thus digitizing cultural prejudices.  For example, in 1988, the UK's   found that   had been using a computer program trained from data of previous admissions staff and that this program had denied nearly 60 candidates who were found to either be women or have non-European sounding names.  Using job hiring data from a firm with racist hiring policies may lead to a machine learning system duplicating the bias by scoring job applicants by similarity to previous successful applicants.  Another example includes predictive policing company  's predictive algorithm that resulted in \"disproportionately high levels of over-policing in low-income and minority communities\" after being trained with historical crime data. \n While responsible   and documentation of algorithmic rules used by a system is considered a critical part of machine learning, some researchers blame lack of participation and representation of minority population in the field of AI for machine learning's vulnerability to biases.  In fact, according to research carried out by the Computing Research Association (CRA) in 2021, \"female faculty merely make up 16.1%\" of all faculty members who focus on AI among several universities around the world.  Furthermore, among the group of \"new U.S. resident AI PhD graduates,\" 45% identified as white, 22.4% as Asian, 3.2% as Hispanic, and 2.4% as African American, which further demonstrates a lack of diversity in the field of AI. \n AI can be well-equipped to make decisions in technical fields, which rely heavily on data and historical information. These decisions rely on objectivity and logical reasoning.  Because human languages contain biases, machines trained on language   will necessarily also learn these biases. \n Other forms of ethical challenges, not related to personal biases, are seen in health care. There are concerns among health care professionals that these systems might not be designed in the public's interest but as income-generating machines.  This is especially true in the United States where there is a long-standing ethical dilemma of improving health care, but also increasing profits. For example, the algorithms could be designed to provide patients with unnecessary tests or medication in which the algorithm's proprietary owners hold stakes. There is potential for machine learning in health care to provide professionals an additional tool to diagnose, medicate, and plan recovery paths for patients, but this requires these biases to be mitigated. \n Since the 2010s, advances in both machine learning algorithms and computer hardware have led to more efficient methods for training   (a particular narrow subdomain of machine learning) that contain many layers of nonlinear hidden units.  By 2019, graphic processing units ( ), often with AI-specific enhancements, had displaced CPUs as the dominant method of training large-scale commercial cloud AI.    estimated the hardware computing used in the largest deep learning projects from AlexNet (2012) to AlphaZero (2017), and found a 300,000-fold increase in the amount of compute required, with a doubling-time trendline of 3.4 months. \n A   or    is a type of   in which an electrically adjustable material is used to emulate the function of a  . \"Physical\" neural network is used to emphasize the reliance on physical hardware used to emulate   as opposed to software-based approaches. More generally the term is applicable to other artificial neural networks in which a   or other electrically adjustable resistance material is used to emulate a neural synapse. \n  is a sub-field of machine learning, where the machine learning model is run on   with limited computing resources such as  ,   and  .  Running machine learning model in embedded devices removes the need for transferring and storing data on cloud servers for further processing, henceforth, reducing data breaches and privacy leaks happening because of transferring data, and also minimizes theft of intellectual properties, personal data and business secrets. Embedded Machine Learning could be applied through several techniques including  ,  using  ,  optimization of machine learning models and many more.   ,  ,  , Low-Rank Factorization, Network Architecture Search (NAS) & Parameter Sharing are few of the techniques used for optimization of machine learning models.\n  containing a variety of machine learning algorithms include the following:\n"}
]